import sqlite3

anketi = [
    (1, 'Максим', 'Домрин', "1968-05-25", 'мужской', "2005-04-05", 'Грузчик', 'Продаж', 35000.00),
    (2, 'Михаил', "Чернов", "1999-02-30", "мужской", "2022-02-24", "Менеджер", "IT", 102000.00),
    (3, "Артур", "Саркисян", "1952-02-24", "мужской", "1999-07-18", "Менеджер", "Продаж", 148800.00),
    (4, "Адриано", "Синчилло", "1986-08-20", "мужской", "2012-05-18", "Маркетолог", "Продаж", 228000.00),
    (5, "Родион", "Ипполитов", "1973-09-15", "мужской", "2017-11-30", "Кассир", "Главный", 52000.00),
    (6, "Иван", "Гончаров", "1993-12-27", "мужской", "2019-01-10", "Администратор", "Главный", 75000.00),
    (7, "Станислав", "Петин", "1990-01-10", "мужской", "2014-12-03", "Дизайнер", "Продаж", 150000.00),
    (8, "Валентина", "Скрежет", "1956-09-14", "женский", "1999-12-03", "Кассир", "Главный", 52000.00),
    (9, "Авдотья", "Святодуб", "1985-04-10", "женский", "2021-02-24", "Бухгалтер", "Бухгалтерия", 52000.00),
    (10, "Иван", "Петров", "1982-12-27", "мужской", "1997-12-12", "Заместитель директора", "Главный", 200000.00),
    (42, "Баламут", "Болотоход", "934-04-01", "мужской", "2022-03-05", "Бухгалтер", "Бухгалтерия", 52000.00)
    ]
with sqlite3.connect('Аптека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Анкеты VALUES(?, ?, ?, ?, ?, ?, ?, ?, ?)", anketi)

bl_listi = [
    (184501, 3, "2022-11-04", "2022-04-27", "Болезнь", "ОРВИ", True),
    (298743, 1, "2023-02-24", "2023-03-24", "Личная", "-", False),
    (321452, 9, "2023-01-03", "2023-03-27", "Болезнь", "COVID-19", True),
    (214908, 5, "2023-12-03", "2023-04-01", "Болезнь", "ОРВИ", True),
    (165654, 2, "2022-11-12", "2023-0-24", "Болезнь", "COVID-19", True),
    (435387, 4, "2023-07-01", "2023-04-03", "Болезнь", "Перелом", True),
    (267865, 6, "2023-09-02", "2023-02-32", "Болезнь", "ОРВИ", True),
    (760061, 10, "2023-04-11", "2023-10-11", "Болезнь", "ОРВИ", False),
    (348906, 1, "2014-04-03", "2023-04-01", "Личная", "-", False),
    (251255, 8, "2023-04-11", "2022-11-30", "Болезнь", "ОРВИ", True),
    (487675, 2, "2012-06-19", "2012-06-20", "Болезнь", "ОРВИ", True),
    (135401, 3, "2016-10-04", "2022-04-27", "Болезнь", "ОРВИ", True),
    (224243, 1, "2018-10-02", "2023-03-24", "Болезнь", "Перелом", True),
    (821152, 9, "2015-04-03", "2023-03-27", "Болезнь", "COVID-19", True),
    (289908, 5, "2023-11-03", "2023-04-01", "Болезнь", "Перелом", True),
    (106754, 2, "2017-12-12", "2023-02-24", "Болезнь", "COVID-19", False),
    (436707, 4, "2012-08-01", "2023-04-03", "Болезнь", "Перелом", True),
    (257665, 6, "2020-08-02", "2023-02-32", "Болезнь", "ОРВИ", True),
    (715761, 10, "2021-03-11", "2023-04-11", "Болезнь", "ОРВИ", True),
    (289855, 8, "2008-11-11", "2022-11-30", "Болезнь", "Перелом", True),
    (341206, 7, "2021-12-03", "2023-04-01", "Личная", "-", False),
    (713361, 10, "2021-04-11", "2023-10-15", "Болезнь", "ОРВИ", False),
    (234755, 8, "2009-11-11", "2022-11-30", "Болезнь", "Перелом", True),
    (347886, 1, "2020-12-03", "2023-04-01", "Личная", "-", False),
    (144401, 42, "2012-10-04", "2022-04-27", "Болезнь", "ОРВИ", True),
    (244243, 42, "2022-02-024", "2023-03-24", "Болезнь", "Перелом", True),
    (844152, 42, "2022-04-03", "2023-03-27", "Болезнь", "COVID-19", False),
    (244908, 42, "2022-11-03", "2023-04-01", "Болезнь", "Перелом", True),
    (144754, 42, "2022-12-12", "2023-02-24", "Болезнь", "COVID-19", True)
    ]
with sqlite3.connect('Аптека.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Больничные_листы VALUES(?, ?, ?, ?, ?, ?, ?)", bl_listi)
