import sqlite3

anketi = [
    (1, 'Максим', 'Домрин', "1968-25-05", 'мужской', "2005-04-05", 'Грузчик', 'Продаж', 35000.00),
    (2, 'Михаил', "Чернов", "1999-30-02", "мужской", "2022-24-02", "Менеджер", "IT", 102000.00),
    (3, "Артур", "Саркисян", "1952-24-02", "мужской", "1999-18-07", "Менеджер", "Продаж", 148800.00),
    (4, "Адриано", "Синчилло", "1986-20-08", "мужской", "2012-17-05", "Маркетолог", "Продаж", 52000.00),
    (5, "Родион", "Ипполитов", "1973-15-09", "мужской", "2017-30-11", "Кассир", "Главный", 52000.00),
    (6, "Иван", "Гончаров", "1993-27-12", "мужской", "2019-01-10", "Администратор", "Главный", 75000.00),
    (7, "Станислав", "Петин", "1990-10-01", "мужской", "2014-12-03", "Дизайнер", "Продаж", 150000.00),
    (8, "Валентина", "Скрежет", "1956-14-09", "женский", "1999-12-03", "Кассир", "Главный", 52000.00),
    (9, "Авдотья", "Святодуб", "1985-10-04", "женский", "2021-24-02", "Кассир", "Главный", 52000.00),
    (10, "Баламут", "Болотоход", "1242-27-12", "мужской", "1997-12-12", "Заместитель директора", "Главный", 200000.00)
    ]
with sqlite3.connect('Анкета.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Анкета VALUES(?, ?, ?, ?, ?, ?, ?, ?, ?)", anketi)

bl_listi = [
    (184501, 3, "2022-20-04", "2022-27-04", "Болезнь", "ОРВИ", True),
    (298743, 1, "2023-24-02", "2023-24-03", "Личная", "-", False),
    (321452, 9, "2023-01-03", "2023-17-03", "Болезнь", "COVID-19", True),
    (214908, 5, "2023-12-03", "2023-01-04", "Болезнь", "ОРВИ", True),
    (162954, 2, "2022-15-12", "2023-24-02", "Болезнь", "COVID-19", True),
    (432587, 4, "2023-07-01", "2023-03-04", "Болезнь", "Перелом", True),
    (267565, 6, "2023-20-02", "2023-32-02", "Болезнь", "ОРВИ", True),
    (767761, 10, "2023-04-11", "2023-11-11", "Болезнь", "ОРВИ", True),
    (254255, 8, "2022-17-11", "2022-30-11", "Болезнь", "ОРВИ", True),
    (346346, 7, "2023-19-03", "2023-01-04", "Болезнь", "ОРВИ", True)
]
with sqlite3.connect('Анкета.db') as con:
    cur = con.cursor()
    cur.executemany("INSERT INTO Больничные_листы VALUES(?, ?, ?, ?, ?, ?, ?)", bl_listi)